Управление_торговлей.ПБТ/src/InformationRegisters/Константы/Константы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Константы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      <types>Boolean</types>
      <types>CatalogRef.ВидыЦен</types>
      <types>CatalogRef.Организации</types>
      <types>String</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/CommonModules/КонстантыСервер/Module.bsl
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Константы.Имя КАК Имя,
		|	Константы.Значение КАК Значение,
		|	Константы.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.Константы КАК Константы
		|ГДЕ
		|	Константы.Имя = &Имя";
	Запрос.УстановитьПараметр("Имя", ИмяКонстанты);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;

КонецФункции
